// Умови: предметній області -> аптека K=10, G=3
//1) Виділитисутності(мінімумК,мінімумГрізнізазмістом),якіфункціонують в предметній області, та для реалізації яких будуть створені класи.
//2) Описативластивості(якмінімумназву,тип)(мінімумГ)цихсутностей(змінні члени класу).
//3) Описати дії (мінімум Г+1) сутностей та над сутностями (методи класу) та взаємодії між сутностями.
//4) Описати об’єкти предметної області (конкретні реалізації класу).
//5) Між деякими класами (не менш ніж між двома парами класів) повинно бути
//
//присутнім наслідування. Реалізувати програмно:
//1) Все, що описано вручну, повинно бути реалізовано програмно.
//2) Обов’язково повинні бути реалізовані для кожного класу:
// мінімум 2 конструктора, один з яких конструктор за замовчанням;
// мінімум Г змінних-членів класу;
// мінімум Г+1 методи класу, серед них обов’язкові модифікатори ((set)
//задають/встановлюють значення змінних-членів класу) та селектори ((get)
//зчитують, але не змінюють значення змінних-членів класу).
//3) Обов’язково має бути реалізованим інтерактивний інтерфейс користувача для взаємодії. (в т.ч. для отримання інформації про предметну область та наявні
//класи).


// write c++ code
#include <iostream>
#include <string>

using namespace std;

class Pharmacy {
    string name;
    string address;
    string phone;
    string email;
    string website;
    string owner;
    string manager;
};